rt/ws/rm/src/test/java/org/objectweb/celtix/ws/rm/resources/GreetMeDocLiteralRequest.xml

<?xml version="1.0" encoding="utf-8" ?>
<SOAP-ENV:Envelope 
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body>
        <ns4:greetMeRequest xmlns:ns4="http://objectweb.org/hello_world_soap_http/types">
            <ns4:requestType>You</ns4:requestType>
        </ns4:greetMeRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
